# Գրեք ծրագիր, որը կավելացնի, հանի, կբազմապատկի կամ կբաժանի երկու թվեր: Գործողության համարները և նշանը
# մուտքագրվում են օգտագործողի կողմից: Հաշվարկն ավարտելուց հետո ծրագիրը չպետք է դադարեցվի, այլ պետք է պահանջի
# նոր տվյալներ հաշվարկների համար։ Ծրագրի ավարտը պետք է իրականացվի՝ որպես գործողության նշան մուտքագրելով «0» նիշը:
# Եթե օգտագործողը մուտքագրում է անվավեր նիշ (ոչ թե «0», «+», «-», «*», «/»), ապա ծրագիրը պետք է տեղեկացնի
# նրան սխալի մասին և նորից հարցնի գործողության բնույթը։ Նաև տեղեկացրեք օգտատիրոջը զրոյի վրա բաժանելու անհնարինության
# մասին, եթե նա որպես բաժանարար մուտքագրել է 0։



while True:
    num_1 = int(input("Input a number: "))
    num_2 = int(input("Input a number: "))
    sym = input("Input symbol ""+,-,/,* ")
    if sym == "0":
        print("If you would like to continue input anything else 0 ")
        break
    elif sym == "+":
        print(f'{num_1} + {num_2} = {num_1 + num_2}')
    elif sym == "-":
        print(f'{num_1} - {num_2} = {num_1 - num_2}')
    elif sym == "*":
        print(f'{num_1} * {num_2} = {num_1 * num_2}')
    elif sym == "/":
        if num_2 != 0:
            print(f'{num_1} / {num_2} = {num_1 / num_2}')
        else:
            print('You  can\'t divide numbers to 0')




